[
    {
        "title": "Software Developer @ Watonamous",
        "location": "Waterloo, Canada",
        "time":"September 2023 - Present",
        "description":["Implemented navigation system for autonomous vehicle based on sensor data obtained using ROS2 Framework.", "Developed motion control algorithms with C++ to effectively guide vehicle through potential obstacles.", "Reproduced test environment across platforms using Docker, ensuring reliable deployment on cloud servers."],
        "image":"images/experience/watonomousLogo.jpg"
    },
    {
        "title":"Software Developer @ Waterloop",
        "location":"Waterloo, Canada",
        "time":"September 2023 - Present",
        "description": ["Implemented a custom data hook utilizing JavaScript, retrieving inventory data from the Waterloop API and displaying the information on the website’s product page.","Conducted testing and executed a responsive web design using React to guarantee optimal scaling of the website across various screen sizes.", "Developed a contact form facilitating prospective donors to submit their details and initiate communication with our team"],
        "image": "images/experience/waterloopLogo.png"
    },
    {
        "title":"President of Business Council @ A.Y. Jackson Secondary School",
        "location":"Toronto, Canada",
        "time":"June 2022 - June 2023",
        "description": ["Led a 12-person executive team dedicated to enhancing youth financial literacy for over 100 club members.", "Organized annual curriculum plan, integrating financial lessons with interactive events.", "Hosted the AYJ Stock Market Competition, overseeing a community of over 200 active traders."],
        "image":"images/experience/businessCouncilLogo.png"
    },
    {
        "title":"Senior Lecturer of Coding Club @ A.Y. Jackson Secondary School",
        "location":"Toronto, Canada",
        "time":"June 2022 - June 2023",
        "description": ["Delivered 50 hours of competitive programming lessons, technical interview training, and computer science theory to students pursuing a career in the technology industry.", "Designed data structure and algorithm practice problems using Java, C++, and Python.", "Offered tutorial sessions for students to get assistance on specific problems and topics."],
        "image":"images/experience/codingClubLogo.png"
    },
    {
        "title":"Computer Science Tutor @ A.Y. Jackson Secondary School",
        "location":"Toronto, Canada",
        "time":"Feb 2022 - June 2022",
        "description": ["Delivered 40 hours of engaging lessons to students learning Java.", "Created flashcards, slideshows, and practice questions tailored to the individual needs of each student."],
        "image":"images/experience/ayjLogo.png"
    }
]